// Lab_02.cpp
// Ацедонська Марія
// Лабораторна робота No 2.1
// Лінійні програми.
// Варіант 15


#include <iostream>  // Введення та виведення даних
#include <cmath>      // Математичні функції
using namespace std;

int main()
{
    double b;  // вхідний параметр
    double z1; // результат обчислення 1-го виразу
    //double z2; // результат обчислення 2-го виразу

    cout << "b = "; // Просимо ввести число b
    cin >> b;      // Зчитуємо введене число

    if (b < 2)
    {
        cout << "Error: b must be >= 2" << endl;
        return 1;
    }

    double t = sqrt(b * b - 4);  // t - Допоміжна змінна, Обчислюємо корінь з (b² - 4)

    z1 = sqrt(2 * b + 2 * t) / (t + b + 2);
    //z2 = 1.0 / sqrt(b + 2);

    cout << endl;    // Перехід на новий рядок
    cout << "z1 = " << z1 << endl;   // Виводимо z1
    //cout << "z2 = " << z2 << endl;   // Виводимо z2

    return 0;
}
